<template>
  <div class="info">
    <div class="light"></div>
    <div>
      <div>
        <h1 class="first-title">Политика конфиденциальности</h1>
        <p>
          Настоящая Политика конфиденциальности регулирует обработку персональных данных между «КометаVPN» (далее
          именуемое «Исполнитель») и физическим лицом, пользующимся услугами (далее именуемым «Клиент»). <br />
          Исполнитель обязуется соблюдать требования Федерального закона № 152-ФЗ «О персональных данных», иные
          нормативные акты Российской Федерации, регулирующие обработку персональных данных, а также гарантирует
          обеспечение конфиденциальности и защиты данных Клиента. <br />
          1. Сбор и обработка данных <br />
          1.1. Исполнитель обрабатывает минимальный объём персональных данных, включая:
        </p>
        <ol>
          <li>Адрес электронной почты;</li>
          <li>Telegram ID или аналогичные идентификаторы.</li>
        </ol>
        <p>
          1.2. Исполнитель не собирает и не хранит логи пользовательской активности, такие как данные о посещаемых
          ресурсах, передаваемой информации и других действий Клиента в интернете. <br />
          1.3. Основание для обработки данных: <br />
          Обработка данных осуществляется в соответствии со статьёй 6 Федерального закона № 152-ФЗ «О персональных
          данных» на основании согласия Клиента, предоставляемого в момент регистрации. <br />
          2. Цели обработки данных <br />
          2.1. Обработка данных Клиента осуществляется исключительно в целях:
        </p>
        <ol>
          <li>Регистрации и идентификации пользователя (статья 6 Федерального закона № 152-ФЗ);</li>
          <li>Управления учётной записью Клиента (пункт 5 статьи 6 Федерального закона № 152-ФЗ);</li>
          <li>Обеспечения функционирования услуг;</li>
          <li>Контактирования по вопросам, связанным с предоставлением услуг.</li>
        </ol>
        <p>
          2.2. Дополнительные цели обработки данных могут быть установлены только с согласия Клиента (пункт 4 статьи 9
          Федерального закона № 152-ФЗ). <br />
          3. Защита данных <br />
          3.1. Исполнитель применяет современные протоколы шифрования (например, TLS) для обеспечения безопасности
          персональных данных. <br />
          3.2. Доступ к данным имеют только уполномоченные сотрудники Исполнителя, обязующиеся соблюдать требования
          статьи 19 Федерального закона № 152-ФЗ и иных нормативных актов РФ. <br />
          3.3. Исполнитель принимает меры по защите данных от утраты, несанкционированного доступа, искажения или
          распространения в соответствии с требованиями статьи 18.1 Федерального закона № 152-ФЗ. <br />
          4. Передача данных третьим лицам 4.1. Персональные данные Клиента не передаются третьим лицам, включая
          государственные органы, за исключением случаев, прямо предусмотренных законодательством Российской
          Федерации.<br />
          4.2. Передача данных возможна только: На основании судебного решения (пункт 2 статьи 6 Федерального закона №
          152-ФЗ); По иным обязательным требованиям закона, например, статье 10.1 Федерального закона № 152-ФЗ.
          <br />
          4.3. Исполнитель гарантирует, что в отсутствие правовых оснований данные не передаются третьим лицам. <br />
          5. Аналитика и статистика <br />
          5.1. Для улучшения качества услуг Исполнитель использует только агрегированные и обезличенные данные. <br />
          5.2. Эти данные не позволяют идентифицировать конкретного пользователя и обрабатываются в соответствии с
          пунктом 2 статьи 11 Федерального закона № 152-ФЗ.
        </p>
        <p></p>
      </div>
      <div>
        <h1>Условия использования</h1>
        <p>
          Настоящие условия (далее — «Условия») регулируют использование VPN-сервиса «КометаVPN» (далее — «Сервис») и
          определяют права и обязанности между «КометаVPN» (далее — «Исполнитель») и физическим лицом, использующим
          Сервис (далее — «Клиент»). Используя Сервис, Клиент подтверждает своё согласие с настоящими Условиями.1.
          Назначение Сервиса <br />
          1.1. Сервис предоставляется для обеспечения безопасности передачи данных, защиты конфиденциальности и
          повышения безопасности работы в сети Интернет. <br />
          1.2. Сервис не предназначен для:
        </p>
        <ol>
          <li>Обхода ограничений, установленных законодательством Российской Федерации;</li>
          <li>Доступа к противоправным или запрещённым ресурсам</li>
        </ol>
        <p>
          1.3. Услуги оказываются в соответствии с Федеральным законом №126-ФЗ «О связи» и Федеральным законом №149-ФЗ
          «Об информации, информационных технологиях и о защите информации». <br />
          1.4. Распространение информации о Сервисе, включая рекламные материалы и инструкции, осуществляется строго в
          рамках положений Федерального закона №406-ФЗ. <br />
          2. Ответственность Клиента 2.1. Клиент обязуется:
        </p>
        <ol>
          <li>
            Использовать Сервис в рамках законодательства Российской Федерации (включая статью 10.1 Федерального закона
            №149-ФЗ);
          </li>
          <li>Воздерживаться от действий, наносящих вред Исполнителю, третьим лицам или государственным органам.</li>
        </ol>
        <p>2.2. Клиент несёт ответственность за:</p>
        <ol>
          <li>Нарушение законодательства Российской Федерации при использовании Сервиса;</li>
          <li>Действия, совершённые через его учётную запись, включая противоправные.</li>
        </ol>
        <p>
          2.3. Нарушение обязательств может повлечь прекращение предоставления услуг без возврата уплаченных средств.<br />
          3. Запрет на незаконное использование <br />
          3.1. Запрещается использование Сервиса для:
        </p>
        <ol>
          <li>
            Распространения информации, нарушающей законодательство Российской Федерации (например, экстремистских
            материалов, пиратского контента);
          </li>
          <li>Обхода блокировок ресурсов, запрещённых на территории Российской Федерации;</li>
          <li>Совершения противоправных действий, включая мошенничество, хакерские атаки, или фишинг.</li>
        </ol>
        <p>
          3.2. Исполнитель оставляет за собой право предпринимать меры для предотвращения противоправного использования
          Сервиса. <br />
          4. Ограничение ответственности <br />
          4.1. Исполнитель не несёт ответственности за:
        </p>
        <ol>
          <li>Действия Клиента, нарушающие законодательство Российской Федерации;</li>
          <li>Блокировку доступа к Сервису государственными органами;</li>
          <li>Ограничения или сбои в работе, вызванные форс-мажорными обстоятельствами.</li>
        </ol>
        <p>
          4.2. Услуги предоставляются на условиях «как есть» без гарантий непрерывности или качества. <br />
          4.3. Исполнитель обязуется защищать данные Клиента в соответствии с Федеральным законом №152-ФЗ «О
          персональных данных». <br />
          5. Прекращение предоставления услуг <br />
          5.1. Исполнитель вправе приостановить или прекратить предоставление услуг в случаях:
        </p>
        <ol>
          <li>Нарушения Клиентом настоящих Условий;</li>
          <li>Невыполнения требований законодательства Российской Федерации;</li>
          <li>Требования государственных органов на основании судебных решений или иных обязательных актов.</li>
        </ol>
        <p>
          5.2. Клиенту может быть отказано в доступе к Сервису без предварительного уведомления в случае нарушения
          пунктов 3.1 и 5.1. <br />
          6. Принципы рекламы и инструкций 6.1. Рекламные материалы и инструкции не содержат информации, запрещённой к
          распространению в соответствии с Федеральным законом №406-ФЗ. <br />
          6.2. В инструкциях к Сервису упоминается только настройка защищённого соединения, обеспечение безопасности
          данных и анонимность в сети. <br />
          6.3. Исполнитель подчёркивает, что услуги предоставляются исключительно для законного использования.
        </p>
      </div>
      <div>
        <h1>Соответствие законодательству</h1>
        <p>
          Наш VPN-сервис разработан с учётом всех требований законодательства Российской Федерации и соответствует
          действующим нормативно-правовым актам: <br />
          1. Соответствие законодательству РФ:
        </p>
        <ol>
          <li>
            Сервис полностью отвечает требованиям Федерального закона №149-ФЗ «Об информации, информационных технологиях
            и о защите информации».
          </li>
          <li>
            Не предоставляет информации о создании, использовании или распространении обходных инструментов (например,
            Tor или иных аналогичных средств).
          </li>
        </ol>
        <p>2. Поддержка политики Роскомнадзора:</p>
        <ol>
          <li>
            В рамках Федерального закона №406-ФЗ рекламные материалы и инструкции к сервису не содержат информации о
            методах обхода блокировок.
          </li>
          <li>Информация о сервисе акцентируется на аспектах повышения безопасности пользователей и защиты данных.</li>
        </ol>
        <p>3. Назначение и использование:</p>
        <ol>
          <li>
            Сервис используется исключительно для защиты конфиденциальных данных, обеспечения безопасности соединения и
            повышения удобства работы в сети Интернет.
          </li>
          <li>
            Обеспечивает безопасность работы с данными, но не предназначен для обхода блокировок, установленных
            законодательством РФ.
          </li>
        </ol>
        <p>4. Ответственность пользователя:</p>
        <ol>
          <li>
            Пользователь несёт полную ответственность за соблюдение законодательства Российской Федерации при
            использовании сервиса.
          </li>
          <li class="end_padding">
            Любое использование сервиса с нарушением закона влечёт за собой ответственность в соответствии с действующим
            законодательством.
          </li>
        </ol>
      </div>
    </div>
  </div>
</template>

<script setup></script>

<style scoped>
.info {
  max-width: 539px;
  position: relative;
  margin: 0 10px;
  padding-top: 72px;
}

h1 {
  margin-top: 75px;
  margin-bottom: 16px;
  text-align: center;
}

ol {
  list-style: circle inside;
  margin: 8px 0;
}

li {
  margin: 2px 0;
}

p {
  line-height: 140%;
  font-weight: 200;
}

.first-title {
    margin-top: 0;
}

.end_padding {
  padding-bottom: 100px;
}

.light {
  position: absolute;
  min-width: 100%;
  height: 400px;
  background: radial-gradient(#d400ff8e 0%, #050505 70%);
  z-index: -1;
  animation: opacity 6s ease-in-out infinite;
}

@keyframes opacity {
  100%,
  0% {
    opacity: 0;
  }
  50% {
    opacity: 1;
  }
}
</style>
